## วัตถุประสงค์ของProject

1. **เพื่อวิเคราะห์ปัจจัยเชิงพื้นที่ที่มีผลต่อศักยภาพการติดตั้งโซลาร์เซลล์**
   - ประเมินขนาดพื้นที่หลังคาที่มีประสิทธิภาพ
   - วิเคราะห์ทิศทางและความลาดเอียงของหลังคา 
   - คำนวณผลกระทบจากเงาบัง บริเวณรอบข้าง

2. **เพื่อพัฒนาระบบคำนวณและแสดงผลคะแนนความเหมาะสมในรูปแบบแผนที่ **
   - คำนวณคะแนนความเหมาะสม โดยอิงตามปัจจัยทางกายภาพ
   - แสดงผลในรูปแบบแผนที่เชิงโต้ตอบ เพื่อให้ผู้ใช้งานเข้าถึงข้อมูลได้ง่าย

3. **เพื่อประเมินศักยภาพการผลิตพลังงานไฟฟ้าและคำนวณผลตอบแทนทางการเงิน**
   - คาดการณ์ปริมาณไฟฟ้าที่สามารถผลิตได้ต่อปี 
   - ประเมินผลประหยัดค่าใช้จ่ายด้านพลังงานไฟฟ้า
   - คำนวณระยะเวลาคืนทุน และความคุ้มค่าในการลงทุนเบื้องต้น

4. **เพื่อออกแบบและพัฒนาแอปพลิเคชันที่ใช้งานง่ายสำหรับการประเมินด้วยตนเอง**
   - พัฒนาส่วนต่อประสานผู้ใช้ (UI/UX) ที่ช่วยให้ผู้ใช้งานทั่วไปสามารถเลือกพื้นที่ วาดขอบเขตหลังคา และดูผลวิเคราะห์ได้อย่างสะดวก

5. **เพื่อทดสอบและประเมินประสิทธิภาพความแม่นยำของระบบ **
   - เปรียบเทียบผลการคำนวณพื้นที่และการประเมินพลังงานของระบบกับข้อมูลจริงเพื่อตรวจสอบความแม่นยำและปรับปรุงระบบ
